# 8장-문자열과 일반 함수 벡터화 처리하기

In [1]:
import pandas as pd

### 예제함수 8-1 수학함수 알아보기

In [2]:
import numpy as np

In [200]:
rng = np.random.RandomState(42)
rng

RandomState(MT19937) at 0x287802AD840

In [201]:
ser = pd.Series(rng.randint(0, 10, 4))

In [202]:
ser1 = pd.Series(rng.randint(0, 10, 4))

In [203]:
ser

0    6
1    3
2    7
3    4
dtype: int32

In [204]:
ser1

0    6
1    9
2    2
3    6
dtype: int32

In [8]:
ser + ser

0    12
1     6
2    14
3     8
dtype: int32

In [9]:
ser.__add__(ser)

0    12
1     6
2    14
3     8
dtype: int32

In [10]:
ser.add(ser)

0    12
1     6
2    14
3     8
dtype: int32

In [11]:
ser.radd(ser1)

0    12
1    12
2     9
3    10
dtype: int32

In [12]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [13]:
np.log(np.exp(ser))

0    6.0
1    3.0
2    7.0
3    4.0
dtype: float64

In [14]:
np.matmul(ser,ser)

110

In [15]:
ser.values @ ser.values

110

In [16]:
np.__dict__['matmul']

In [17]:
ser.dot(ser)

110

### 예제 8-2 데이터프레임 브로드캐스팅 이해하기

In [18]:
df_2 = pd.DataFrame((rng.randint(0, 20, (4, 4))), columns=list('QRST'))

In [19]:
df_2

    Q   R   S   T
0  10  10   3   7
1   2   1  11   5
2   1   0  11  11
3  16   9  15  14

In [20]:
type(df_2.iloc[0])

pandas.core.series.Series

In [21]:
df_2 - df_2.iloc[0]

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [22]:
df_2.iloc[0]

Q    10
R    10
S     3
T     7
Name: 0, dtype: int32

In [23]:
df_3 = pd.DataFrame([df_2.iloc[0]])

In [24]:
df_3

    Q   R  S  T
0  10  10  3  7

In [25]:
df_3_s = pd.DataFrame()

In [26]:
for _ in range(4) :
    print("loop")
    df_3_s = df_3_s.append(df_3, ignore_index=True)

loop
loop
loop
loop

In [27]:
df_3_s

    Q   R  S  T
0  10  10  3  7
1  10  10  3  7
2  10  10  3  7
3  10  10  3  7

In [28]:
df_2 - df_3_s

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [29]:
df_2 - df_2.iloc[0]

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [30]:
df_2.subtract(df_2.iloc[0],axis=1)

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [31]:
df_2.subtract(df_2.iloc[0],axis=0)

    Q   R   S   T
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
Q NaN NaN NaN NaN
R NaN NaN NaN NaN
S NaN NaN NaN NaN
T NaN NaN NaN NaN

In [32]:
df_2['R']

0    10
1     1
2     0
3     9
Name: R, dtype: int32

In [33]:
df_2 - df_2['R']

    Q   R   S   T   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [34]:
df_2.subtract(df_2['R'],axis=0)

   Q  R   S   T
0  0  0  -7  -3
1  1  0  10   4
2  1  0  11  11
3  7  0   6   5

In [35]:
df_2.subtract(df_2['R'],axis=1)

    Q   R   S   T   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

### 예제 8-3 rolling expanding 수학함수 알아보기

In [36]:
import numpy as np

In [37]:
rng = np.random.RandomState(42)

In [38]:
df_re = pd.DataFrame(np.random.randn(10, 4),
                 index = pd.date_range('1/1/2000', periods=10),
                 columns = ['A', 'B', 'C', 'D'])

In [39]:
df_re.expanding()

Expanding [min_periods=1,center=False,axis=0]

In [40]:
type(df_re.expanding())

pandas.core.window.expanding.Expanding

In [41]:
count = 0
for i in dir(df_re.expanding()):
    if not i.startswith("_") :
        print(i, end=',  ')
        count += 1
        if count % 5 == 0 :
            print()

A,  B,  C,  D,  agg,
aggregate,  apply,  corr,  count,  cov,
exclusions,  is_datetimelike,  is_freq_type,  kurt,  max,
mean,  median,  min,  ndim,  quantile,
skew,  std,  sum,  validate,  var,

In [42]:
type(df_re.rolling(window=1))

pandas.core.window.rolling.Rolling

In [43]:
count = 0
for i in dir(df_re.rolling(window=1)):
    if not i.startswith("_") :
        print(i, end=',  ')
        count += 1
        if count % 5 == 0 :
            print()

A,  B,  C,  D,  agg,
aggregate,  apply,  corr,  count,  cov,
exclusions,  is_datetimelike,  is_freq_type,  kurt,  max,
mean,  median,  min,  ndim,  quantile,
skew,  std,  sum,  validate,  var,

In [44]:
df_re.sum()

A   -0.782430
B    3.747028
C   -4.993321
D    5.113978
dtype: float64

In [45]:
df_re.cumsum()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  0.761528  0.602094 -0.339831  0.849037
2000-01-03  0.635568  1.749058 -0.616921  1.050159
2000-01-04  1.398831  3.321065 -0.804452  1.327429
2000-01-05  0.743440  3.322394  0.301650  4.005807
2000-01-06  0.285954  4.691387 -1.768833  3.769667
2000-01-07 -0.967654  5.590444 -3.465538  3.128710
2000-01-08 -0.263601  3.813490 -3.047827  4.924256
2000-01-09 -0.244110  3.887449 -4.260496  4.550501
2000-01-10 -0.782430  3.747028 -4.993321  5.113978

In [46]:
df_re.expanding( min_periods=1).sum()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  0.761528  0.602094 -0.339831  0.849037
2000-01-03  0.635568  1.749058 -0.616921  1.050159
2000-01-04  1.398831  3.321065 -0.804452  1.327429
2000-01-05  0.743440  3.322394  0.301650  4.005807
2000-01-06  0.285954  4.691387 -1.768833  3.769667
2000-01-07 -0.967654  5.590444 -3.465538  3.128710
2000-01-08 -0.263601  3.813490 -3.047827  4.924256
2000-01-09 -0.244110  3.887449 -4.260496  4.550501
2000-01-10 -0.782430  3.747028 -4.993321  5.113978

In [47]:
type(df_re.expanding( min_periods=1).sum())

pandas.core.frame.DataFrame

In [48]:
df_re.rolling(window=len(df_re), min_periods=1).sum()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  0.761528  0.602094 -0.339831  0.849037
2000-01-03  0.635568  1.749058 -0.616921  1.050159
2000-01-04  1.398831  3.321065 -0.804452  1.327429
2000-01-05  0.743440  3.322394  0.301650  4.005807
2000-01-06  0.285954  4.691387 -1.768833  3.769667
2000-01-07 -0.967654  5.590444 -3.465538  3.128710
2000-01-08 -0.263601  3.813490 -3.047827  4.924256
2000-01-09 -0.244110  3.887449 -4.260496  4.550501
2000-01-10 -0.782430  3.747028 -4.993321  5.113978

In [49]:
df_re.max()

A    1.366019
B    1.572007
C    1.106101
D    2.678377
dtype: float64

In [50]:
df_re.cummax()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  1.366019  0.622246  0.700144  0.505086
2000-01-03  1.366019  1.146964  0.700144  0.505086
2000-01-04  1.366019  1.572007  0.700144  0.505086
2000-01-05  1.366019  1.572007  1.106101  2.678377
2000-01-06  1.366019  1.572007  1.106101  2.678377
2000-01-07  1.366019  1.572007  1.106101  2.678377
2000-01-08  1.366019  1.572007  1.106101  2.678377
2000-01-09  1.366019  1.572007  1.106101  2.678377
2000-01-10  1.366019  1.572007  1.106101  2.678377

In [51]:
df_re.expanding().max()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  1.366019  0.622246  0.700144  0.505086
2000-01-03  1.366019  1.146964  0.700144  0.505086
2000-01-04  1.366019  1.572007  0.700144  0.505086
2000-01-05  1.366019  1.572007  1.106101  2.678377
2000-01-06  1.366019  1.572007  1.106101  2.678377
2000-01-07  1.366019  1.572007  1.106101  2.678377
2000-01-08  1.366019  1.572007  1.106101  2.678377
2000-01-09  1.366019  1.572007  1.106101  2.678377
2000-01-10  1.366019  1.572007  1.106101  2.678377

In [52]:
df_re.rolling(window=len(df_re),min_periods=1).max()

                   A         B         C         D
2000-01-01  1.366019  0.622246 -1.039975  0.505086
2000-01-02  1.366019  0.622246  0.700144  0.505086
2000-01-03  1.366019  1.146964  0.700144  0.505086
2000-01-04  1.366019  1.572007  0.700144  0.505086
2000-01-05  1.366019  1.572007  1.106101  2.678377
2000-01-06  1.366019  1.572007  1.106101  2.678377
2000-01-07  1.366019  1.572007  1.106101  2.678377
2000-01-08  1.366019  1.572007  1.106101  2.678377
2000-01-09  1.366019  1.572007  1.106101  2.678377
2000-01-10  1.366019  1.572007  1.106101  2.678377

In [53]:
df_diff = pd.DataFrame({'B': [0, 1, 2, np.nan, 4]})

In [54]:
df_diff.cumsum()

     B
0  0.0
1  1.0
2  3.0
3  NaN
4  7.0

In [55]:
df_diff.fillna(0).cumsum()

     B
0  0.0
1  1.0
2  3.0
3  3.0
4  7.0

In [56]:
df_diff.expanding(min_periods=1).sum()

     B
0  0.0
1  1.0
2  3.0
3  3.0
4  7.0

In [57]:
import pandas as pd

### 예제 8-4  사용자 정의 함수를 apply 메소드로  처리하기

In [58]:
pd.Series.__dict__['apply']

In [59]:
pd.DataFrame.__dict__['apply']

In [60]:
import numpy as np

In [61]:
df = pd.DataFrame ({'a' : np.random.randn(6),
                 'b' : ['철수', '영희'] * 3,
                 'c' : np.random.randn(6)})

In [62]:
df

          a   b         c
0  1.333144  철수  0.064368
1 -0.206020  영희 -1.404961
2 -0.225256  철수  0.224134
3 -0.909635  영희  0.796007
4 -0.372624  철수  0.802616
5 -0.245048  영희  0.176036

In [63]:
def my_test(a, c):
    return a % c

In [64]:
df['Value'] = df.apply(lambda row: my_test(row['a'], row['c']), axis=1)

In [65]:
df

          a   b         c     Value
0  1.333144  철수  0.064368  0.045788
1 -0.206020  영희 -1.404961 -0.206020
2 -0.225256  철수  0.224134  0.223012
3 -0.909635  영희  0.796007  0.682379
4 -0.372624  철수  0.802616  0.429992
5 -0.245048  영희  0.176036  0.107023

In [66]:
df.a % df.c

0    0.045788
1   -0.206020
2    0.223012
3    0.682379
4    0.429992
5    0.107023
dtype: float64

In [67]:
def my_test2(row):
    return row['a'] % row['c']

In [68]:
df['Value 2'] = df.apply(my_test2, axis=1)

In [69]:
df

          a   b         c     Value   Value 2
0  1.333144  철수  0.064368  0.045788  0.045788
1 -0.206020  영희 -1.404961 -0.206020 -0.206020
2 -0.225256  철수  0.224134  0.223012  0.223012
3 -0.909635  영희  0.796007  0.682379  0.682379
4 -0.372624  철수  0.802616  0.429992  0.429992
5 -0.245048  영희  0.176036  0.107023  0.107023

In [70]:
sample = pd.DataFrame({'임의의값':[10,100,40] })

In [71]:
sample

   임의의값
0    10
1   100
2    40

In [72]:
sample = pd.concat([sample]*100000).reset_index(drop=True)

In [73]:
sample.head()

   임의의값
0    10
1   100
2    40
3    10
4   100

In [74]:
sample.shape

(300000, 1)

In [75]:
%timeit sample['임의의값'].apply(lambda x: np.nan if x < 90 else x)

94.3 ms ± 14 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [76]:
%timeit sample['임의의값'].mask(sample['임의의값'] < 90, np.nan)

3.64 ms ± 187 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [77]:
sample1 = sample.copy()

In [78]:
sample1 = sample1['임의의값'].apply(lambda x: np.nan if x < 90 else x)

In [79]:
sample1.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [80]:
sample2 = sample.copy()

In [81]:
sample2 = sample2['임의의값'].mask(sample['임의의값'] < 90, np.nan)

In [82]:
sample2.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [83]:
(sample1 == sample2).shape

(300000,)

In [84]:
sample1.isnull().sum(), sample1.notnull().sum()

(200000, 100000)

In [85]:
(sample1 == sample2).sum()

100000

### 예제 8-5 사용자 정의 함수를 map,applymap메소드로 처리하기

In [86]:
pd.Series.__dict__['map']

In [87]:
try : 
    pd.Series.__dict__['applymap']
except KeyError as e :
    print("KeyError : ",e)

KeyError :  'applymap'

In [88]:
try : 
    pd.DataFrame.__dict__['map']
except KeyError as e :
    print("KeyError : ",e)

KeyError :  'map'

In [89]:
pd.DataFrame.__dict__['applymap']

In [90]:
import numpy as np

In [91]:
ser = pd.Series(np.random.randn(6))

In [92]:
ser

0   -0.519954
1   -0.316594
2    0.889356
3   -1.711354
4   -0.599442
5   -0.535517
dtype: float64

In [93]:
def map_test(a):
    print(" 원소별 처리")
    return np.abs(a)

In [94]:
ser.map(map_test)

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

0    0.519954
1    0.316594
2    0.889356
3    1.711354
4    0.599442
5    0.535517
dtype: float64

### 예제 8-6 pipe 메소드 처리하기

In [95]:
import numpy as np

In [96]:
df = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [97]:
def name_length(df) :
    df['length'] = df.name.str.len()
    return df

In [98]:
df.pipe(name_length)

  name program language       born  length
0  김상갑              NaN        NaT       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala        NaT       3

In [99]:
def born_fillna(df) :
    df['born'] = df['born'].fillna(pd.Timestamp("1967-04-25"))
    return df

In [100]:
df.pipe(born_fillna)

  name program language       born  length
0  김상갑              NaN 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [101]:
def pl_fillna(df) :
    df['program language'] = df['program language'].fillna("Java")
    return df

In [102]:
df.pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [103]:
df1 = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [104]:
df1.pipe(name_length).pipe(born_fillna).pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [105]:
df2 = pd.DataFrame()

In [106]:
df2['name'] = ['은옥찬', '은석찬', '은옥주']
df2['gender'] = ['Male', 'Male', 'Female']
df2['age'] = [31, 32, 19]

In [107]:
df2

  name  gender  age
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [108]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [109]:
mean_age_by_group(df2, 'gender')

         age
gender
Female  19.0
Male    31.5

In [110]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [111]:
uppercase_column_name(df2)

  NAME  GENDER  AGE
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [112]:
df3 = pd.DataFrame()

In [113]:
df3['name'] = ['구옥찬', '구석찬', '구옥주']
df3['gender'] = ['Male', 'Male', 'Female']
df3['age'] = [31, 32, 19]

In [114]:
(df3.pipe(mean_age_by_group, col='gender')
   .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5

In [115]:
import pandas as pd

### 예제 8-7  eval 함수와 메소드 처리하기

In [116]:
import numpy as np

In [117]:
rng = np.random.RandomState(42)

In [118]:
nrows, ncols = 100000, 10

In [119]:
print(type(pd.DataFrame(rng.rand(nrows, ncols)) for i in range(2)))

<class 'generator'>

In [120]:
df1, df2 = (pd.DataFrame(rng.rand(nrows, ncols))for i in range(2))

In [121]:
%timeit df1 + df2

3.14 ms ± 147 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [122]:
%timeit pd.eval('df1 + df2')

5.42 ms ± 233 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [123]:
np.allclose(df1 + df2 ,pd.eval('df1 + df2 '))

True

In [124]:
nrows1, ncols1 = 100000, 100

In [125]:
df11, df12,df13, df14 = (pd.DataFrame(rng.rand(nrows1, ncols1))for i in range(4))

In [126]:
%timeit df11 + df12 + df13 + df14

66.9 ms ± 5.31 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [127]:
%timeit pd.eval('df11 + df12 + df13 + df14')

30.9 ms ± 1.16 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [128]:
dfa1 = pd. DataFrame(np.random.randn(10, 2), columns=['평균','분산'])

In [129]:
dfa1

         평균        분산
0 -0.111930 -0.604211
1  0.892452 -0.033688
2 -1.039417 -0.238508
3 -0.965854  0.101730
4  0.087620  1.015319
5 -1.372266 -0.979547
6  1.188430 -0.890992
7 -0.136071  1.885294
8  0.048295 -1.621228
9 -0.413255 -0.090363

In [130]:
dfa1.eval( '평균 + 분산 ')

0   -0.716141
1    0.858764
2   -1.277924
3   -0.864124
4    1.102938
5   -2.351813
6    0.297438
7    1.749223
8   -1.572933
9   -0.503618
dtype: float64

In [131]:
dfa1.eval( '편차  = 평균 - 분산 ')

         평균        분산        편차
0 -0.111930 -0.604211  0.492281
1  0.892452 -0.033688  0.926139
2 -1.039417 -0.238508 -0.800909
3 -0.965854  0.101730 -1.067584
4  0.087620  1.015319 -0.927699
5 -1.372266 -0.979547 -0.392719
6  1.188430 -0.890992  2.079422
7 -0.136071  1.885294 -2.021365
8  0.048295 -1.621228  1.669522
9 -0.413255 -0.090363 -0.322892

In [132]:
dfa1

         평균        분산
0 -0.111930 -0.604211
1  0.892452 -0.033688
2 -1.039417 -0.238508
3 -0.965854  0.101730
4  0.087620  1.015319
5 -1.372266 -0.979547
6  1.188430 -0.890992
7 -0.136071  1.885294
8  0.048295 -1.621228
9 -0.413255 -0.090363

In [133]:
dfa1.eval( '편차 = 평균 - 분산 ', inplace=True)

In [134]:
dfa1

         평균        분산        편차
0 -0.111930 -0.604211  0.492281
1  0.892452 -0.033688  0.926139
2 -1.039417 -0.238508 -0.800909
3 -0.965854  0.101730 -1.067584
4  0.087620  1.015319 -0.927699
5 -1.372266 -0.979547 -0.392719
6  1.188430 -0.890992  2.079422
7 -0.136071  1.885294 -2.021365
8  0.048295 -1.621228  1.669522
9 -0.413255 -0.090363 -0.322892

In [135]:
dfa2 = pd. DataFrame(np.random.randn(10, 2), columns=range(0,2))

In [136]:
dfa2

          0         1
0 -0.385882 -0.935262
1  0.553436 -1.585142
2 -0.953660  0.596154
3 -0.980352 -0.388310
4 -2.099543  0.117641
5  0.509150  1.359342
6 -1.347028  1.058982
7  2.622935  1.129877
8  0.067352  0.789880
9 -1.052090  1.878922

In [137]:
dfa2.eval( '0 +1 ')

1

In [138]:
try :
    pd.eval('dfa2.0 + dfa2.1')
except Exception as e  :
    print("exception ", e)

exception  invalid syntax (<unknown>, line 1)

In [139]:
try :
    df_add = pd.eval('dfa2[0] + dfa2[1]')
except Exception as e  :
    print("exception ", e)

In [140]:
df_add

0   -1.321144
1   -1.031706
2   -0.357506
3   -1.368662
4   -1.981903
5    1.868492
6   -0.288045
7    3.752812
8    0.857232
9    0.826832
dtype: float64

In [141]:
df1, df2, df3, df4, df5 = (pd.DataFrame(rng.randint(0, 1000, (100, 3)))
                           for i in range(5))

In [142]:
result1 = -df1 * df2 / (df3 + df4) - df5

In [143]:
result2 = pd.eval('-df1 * df2 / (df3 + df4) - df5')

In [144]:
np.allclose(result1, result2)

True

In [145]:
result1 = (df1 < 0.5) & (df2 < 0.5) | (df3 < df4)

In [146]:
result2 = pd.eval('(df1 < 0.5) & (df2 < 0.5) | (df3 < df4)')

In [147]:
np.allclose(result1, result2)

True

In [148]:
result3 = pd.eval('(df1 < 0.5) and (df2 < 0.5) or (df3 < df4)')

In [149]:
np.allclose(result1, result3)

True

In [150]:
result1 = df2.T[0] + df3.iloc[1]

In [151]:
result2 = pd.eval('df2.T[0] + df3.iloc[1]')

In [152]:
np.allclose(result1, result2)

True

In [153]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('AB'))

In [154]:
column_mean = df.mean(axis=1)

In [155]:
column_mean.head()

0   -0.195347
1   -0.316963
2    0.701933
3    0.247501
4    0.449790
dtype: float64

In [156]:
result1 = df['A'] + column_mean

In [157]:
result2 = df.eval('A + @column_mean')

In [158]:
np.allclose(result1, result2)

True

### 예제 8-8  query 함수와 메소드 처리하기

In [159]:
dfq1 = pd. DataFrame(np.random.randn(10, 2), columns=list('ab'))

In [160]:
dfq1

          a         b
0 -0.138352  1.327081
1  0.460283  1.486785
2  0.789224  0.154587
3 -1.333083  1.768373
4 -1.209891 -0.213341
5  0.559029  0.272420
6 -0.572557  0.716328
7  0.154159  0.454234
8  0.045594 -1.844688
9 -0.601402 -0.201206

In [161]:
dfq1.query('a < b')

          a         b
0 -0.138352  1.327081
1  0.460283  1.486785
3 -1.333083  1.768373
4 -1.209891 -0.213341
6 -0.572557  0.716328
7  0.154159  0.454234
9 -0.601402 -0.201206

In [162]:
try :
    dfq1.query('c = a < b',inplace=True)
except Exception as e :
    print('Exception :', e)

Exception : cannot assign without a target object

In [163]:
dfq1.query('a < b')

          a         b
0 -0.138352  1.327081
1  0.460283  1.486785
3 -1.333083  1.768373
4 -1.209891 -0.213341
6 -0.572557  0.716328
7  0.154159  0.454234
9 -0.601402 -0.201206

In [164]:
dfq1[dfq1.a < dfq1.b]

          a         b
0 -0.138352  1.327081
1  0.460283  1.486785
3 -1.333083  1.768373
4 -1.209891 -0.213341
6 -0.572557  0.716328
7  0.154159  0.454234
9 -0.601402 -0.201206

In [165]:
df_q2 = dfq1.query('a < b')

In [166]:
df_q2

          a         b
0 -0.138352  1.327081
1  0.460283  1.486785
3 -1.333083  1.768373
4 -1.209891 -0.213341
6 -0.572557  0.716328
7  0.154159  0.454234
9 -0.601402 -0.201206

In [167]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('가나'))

In [168]:
result1 = df[(df.가 < 0.5) & (df.나 < 0.5)]

In [169]:
result2 = pd.eval('df[(df.가 < 0.5) & (df.나 < 0.5)]')

In [170]:
np.allclose(result1, result2)

True

In [171]:
result3 = df.query('가 < 0.5 and 나 < 0.5')

In [172]:
np.allclose(result1, result3)

True

In [173]:
Bmean = df['나'].mean()

In [174]:
Bmean

-0.07545801227787537

In [175]:
(df.가 < Bmean) & (df.나 < Bmean)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [176]:
result11 = df[(df.가 < Bmean) & (df.나 < Bmean)]

In [177]:
result11.shape

(2, 2)

In [178]:
result11

          가         나
6 -1.955984 -0.577401
7 -0.101325 -0.323725

In [179]:
result12 = df.query("(가 < @Bmean) & (나 < @Bmean)")

In [180]:
result12.shape

(2, 2)

In [181]:
result12

          가         나
6 -1.955984 -0.577401
7 -0.101325 -0.323725

In [182]:
np.allclose(result11, result12)

True

In [183]:
a = list('가나다라마바')

In [184]:
b = range(6)

In [185]:
df_ = pd.DataFrame({'X':pd.Series(a),'Y': pd.Series(b)})

In [186]:
df_

   X  Y
0  가  0
1  나  1
2  다  2
3  라  3
4  마  4
5  바  5

In [187]:
df_Y = df_.query('Y < 3')

In [188]:
df_Y

   X  Y
0  가  0
1  나  1
2  다  2

In [189]:
import numexpr as ne

In [190]:
ne_works = ne.evaluate('"가" < "라"')

In [191]:
ne_works

array(True)

In [192]:
df_.X < '라'

0     True
1     True
2     True
3    False
4    False
5    False
Name: X, dtype: bool

In [193]:
df_X = df_.query('X < "라"')

In [194]:
df_X

   X  Y
0  가  0
1  나  1
2  다  2